In [1]:
import numpy as nu
import pandas as pd
df = pd.read_csv('../data/Company.csv')
df.head()

,EmployeeID,birthdate_key,age,city_name,department,job_title,gender
0,1318,1/3/1954,61,Vancouver,Executive,CEO,M
1,1319,1/3/1957,58,Vancouver,Executive,VP Stores,F
2,1320,1/2/1955,60,Vancouver,Executive,Legal Counsel,F
3,1321,1/2/1959,56,Vancouver,Executive,VP Human Resources,M
4,1322,1/9/1958,57,Vancouver,Executive,VP Finance,M

In [2]:
df.loc[df.age<=40 & df.department.isin(['Dairy','Bakery'])].head()

Empty DataFrame
Columns: [EmployeeID, birthdate_key, age, city_name, department, job_title, gender]
Index: []

In [3]:
df.query("age<=40 & (department=='Dairy'|department=='Bakery')").head()

,EmployeeID,birthdate_key,age,city_name,department,job_title,gender
3608,5788,1/12/1975,40,Chilliwack,Dairy,Dairy Person,F
3609,5789,1/13/1975,40,Chilliwack,Dairy,Dairy Person,F
3610,5790,1/13/1975,40,Kelowna,Dairy,Dairy Person,F
3611,5791,1/14/1975,40,Kelowna,Dairy,Dairy Person,M
3613,5793,1/22/1975,40,Richmond,Bakery,Baker,M

In [4]:
df.iloc[(df.EmployeeID%2==1).values,[0,2,-2]].head()

   EmployeeID  age                      job_title
1        1319   58                      VP Stores
3        1321   56             VP Human Resources
5        1323   53      Exec Assistant, VP Stores
6        1325   51  Exec Assistant, Legal Counsel
8        1329   48                  Store Manager

In [5]:
df_init_idx=df.columns

In [6]:
df=df.set_index(df.columns[-3:].tolist())

In [7]:
df=df.swaplevel(0,2)

In [8]:
df=df.reset_index(level=1)

In [9]:
df=df.rename_axis(index={df.index[0]:'Gender'})

In [10]:
df.index=df.index.map(lambda x:'_'.join(x))

In [11]:
df.index=df.index.map(lambda x:tuple(x.split('_')))

In [12]:
df=df.rename_axis(index={'gender','department'})

In [13]:
df=df.reset_index().reindex(df_init_idx,axis=1)

In [14]:
df.head()

,EmployeeID,birthdate_key,age,city_name,department,job_title,gender
0,1318,1/3/1954,61,Vancouver,M,CEO,Executive
1,1319,1/3/1957,58,Vancouver,F,VP Stores,Executive
2,1320,1/2/1955,60,Vancouver,F,Legal Counsel,Executive
3,1321,1/2/1959,56,Vancouver,M,VP Human Resources,Executive
4,1322,1/9/1958,57,Vancouver,M,VP Finance,Executive